<?php
// +----------------------------------------------------------------------
// | 此文件为Workerman的入口文件
// +----------------------------------------------------------------------
// | 1. 环境配置请同步index.php文件
// +----------------------------------------------------------------------
// | 2. 运行socket服务时请首先运行此文件
// +----------------------------------------------------------------------
// | 3. 使用手册：http://doc3.workerman.net
// +----------------------------------------------------------------------
// | Author: yiyun <jianhaihao@gmail.com>
// +----------------------------------------------------------------------

// [ 应用入口文件 ]

// 测试环境
defined('WANCLL_ENV') or define('WANCLL_ENV', 'dev');

// 产品环境
// defined('WANCLL_ENV') or define('WANCLL_ENV', 'prod');

// API版本号
defined('API_VERSION') or define('API_VERSION', '1.4.0');

// 绑定workman模块
define('BIND_MODULE', 'workerman/socket');

// 定义应用目录
define('APP_PATH', __DIR__ . '/application/');
// 加载框架引导文件
require __DIR__ . '/thinkphp/start.php';
